docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-05-10 cs 17:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>How to build Dockerfiles in Kubernetes</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Gergely Szabo" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">How to build Dockerfiles in Kubernetes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4a967f2">1. Introduction</a></li>
<li><a href="#orgd5d3fe0">2. Pitfalls</a>
<ul>
<li><a href="#org9eab11b">2.1. Docker in Docker</a></li>
<li><a href="#org850a2ec">2.2. Docker Registries and Authentication</a></li>
<li><a href="#org2cdd0e0">2.3. Reusable Kubernetes jobs</a></li>
</ul>
</li>
<li><a href="#orgc59364b">3. Building Dockerfiles in Kubernetes</a>
<ul>
<li><a href="#org87c6ef8">3.1. Storing the Docker credentials in Kubernetes</a>
<ul>
<li><a href="#org621c733">3.1.1. Option 1: Copy credentials from your laptop</a></li>
<li><a href="#orgdda9208">3.1.2. Option 2: Specify credentials directly</a></li>
</ul>
</li>
<li><a href="#org08f45a3">3.2. Starting the job</a>
<ul>
<li><a href="#orgda55a8c">3.2.1. Starting a job in a reusable way</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org4a967f2" class="outline-2">
<h2 id="org4a967f2"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Besides running long running services, Kubernetes can be used to run batch
jobs as well.
</p>

<p>
One can use this feature for example to build Dockerfiles. This short post
wants to highlight a simple and elegant way of performing this task.
</p>
</div>
</div>

<div id="outline-container-orgd5d3fe0" class="outline-2">
<h2 id="orgd5d3fe0"><span class="section-number-2">2</span> Pitfalls</h2>
<div class="outline-text-2" id="text-2">
<p>
Using Kubernetes jobs to build Dockerfiles seems to be a pretty
straightforward task at the first sight. There are some pitfalls though.
</p>
</div>

<div id="outline-container-org9eab11b" class="outline-3">
<h3 id="org9eab11b"><span class="section-number-3">2.1</span> Docker in Docker</h3>
<div class="outline-text-3" id="text-2-1">
<p>
We assume that your Kubernetes uses Docker as container runtime. That means
that each of your host machine runs a Docker engine.
</p>

<p>
Jobs, are realized as Pods running a single container. If you want to use
Docker commands (like <code>docker build</code>, <code>docker push</code>, etc.) from Jobs (i.e.
from inside a container) you are facing the problem of running Docker inside
Docker which is discouraged<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> in general.
</p>
</div>
</div>

<div id="outline-container-org850a2ec" class="outline-3">
<h3 id="org850a2ec"><span class="section-number-3">2.2</span> Docker Registries and Authentication</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Even if you manage to execute Docker commands from inside the container, you
might be surprised when your first <code>docker push</code> command fails. Because the
<code>push</code> command succeeds only when you are successfully authorized by the
given Docker registry.
</p>

<p>
That's a minor issue only and Kubernetes is designed to mitigate such issues
in a meaningful way.
</p>
</div>
</div>

<div id="outline-container-org2cdd0e0" class="outline-3">
<h3 id="org2cdd0e0"><span class="section-number-3">2.3</span> Reusable Kubernetes jobs</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Kubernetes resources (the more complex ones at least) are described by a
manifest file. The manifest file of a given deployment, pod, service, job
etc. varies a bit from deployment to deployment that makes the manifest files
hard to reuse.
</p>

<p>
For deployments, services, etc. resource types, we can use Helm packages that
addresses exactly this issue. Unfortunately, Helm does not support jobs&#x2026;
</p>
</div>
</div>
</div>

<div id="outline-container-orgc59364b" class="outline-2">
<h2 id="orgc59364b"><span class="section-number-2">3</span> Building Dockerfiles in Kubernetes</h2>
<div class="outline-text-2" id="text-3">
<p>
The task we want to perform is to take a given git repository that contains a
Dockerfile and potentially other helper files and build it in a Kubernetes
cluster. Finally, we want to push the resulted Docker image to one or more
Docker repositories.
</p>

<p>
So our inputs are:
</p>
<ul class="org-ul">
<li>URL of a git repository</li>
<li>tag(s) that will be assigned to the built image</li>
<li>credentials that authorize us at the Docker registry</li>
</ul>

<p>
Let's first take care of the last in the list: Docker registry credentials.
</p>
</div>

<div id="outline-container-org87c6ef8" class="outline-3">
<h3 id="org87c6ef8"><span class="section-number-3">3.1</span> Storing the Docker credentials in Kubernetes</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Following the best practices, we will store our credentials as Kubernetes
<code>secret</code>. 
</p>
</div>

<div id="outline-container-org621c733" class="outline-4">
<h4 id="org621c733"><span class="section-number-4">3.1.1</span> Option 1: Copy credentials from your laptop</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
This may be the simpler case. We assume that you have logged in to all the
needed Docker registries from your laptop and a proper config file has been
created at <code>$HOME/.docker/config.json</code>.
</p>

<p>
We can reuse create the Kubernetes secret from this file:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>Creating Docker secrets from local config file</label><pre class="src src-bash">kubectl create secret generic docker-image-builder-secret <span style="color: #2d9574;">\</span>
        --from-file=.dockerconfigjson=$<span style="color: #4f97d7;">{</span><span style="color: #7590db;">HOME</span><span style="color: #4f97d7;">}</span>/.docker/config.json
</pre>
</div>

<pre class="example">
secret "docker-image-builder-secret" created

</pre>
</div>
</div>

<div id="outline-container-orgdda9208" class="outline-4">
<h4 id="orgdda9208"><span class="section-number-4">3.1.2</span> Option 2: Specify credentials directly</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
Another option is to create the secret by specifying the credentials
directly using the following command:
</p>

<div class="org-src-container">
<pre class="src src-bash">kubectl create secret docker-registry docker-image-builder-secret <span style="color: #2d9574;">\</span>
        --docker-server=DOCKER_REGISTRY_SERVER                    <span style="color: #2d9574;">\</span>
        --docker-username=DOCKER_USER                             <span style="color: #2d9574;">\</span>
        --docker-password=DOCKER_PASSWORD                         <span style="color: #2d9574;">\</span>
        --docker-email=DOCKER_EMAIL
</pre>
</div>

<pre class="example">
secret "docker-image-builder-secret" created

</pre>
</div>
</div>
</div>

<div id="outline-container-org08f45a3" class="outline-3">
<h3 id="org08f45a3"><span class="section-number-3">3.2</span> Starting the job</h3>
<div class="outline-text-3" id="text-3-2">
<p>
The next task is to create a Kubernetes job which:
</p>
<ul class="org-ul">
<li>starts a Pod that has <code>docker</code> CLI in it, see the official docker image</li>
<li>can use the host's Docker engine in order to perform the <code>docker build</code>
command</li>
<li>has the docker credentials stored in the secret mounted at the expected
location (<code>$HOME/.docker/config.json</code>)</li>
<li>has a volume with the given git repository</li>
</ul>

<p>
When run, the pod shall execute a <code>docker build</code> command with the right
parameters then a <code>docker push</code> command for each of the image tag.
</p>

<p>
To write a complying job manifest takes some time but it is a reasonably
simple task for an experienced Kubernetes user.
</p>
</div>

<div id="outline-container-orgda55a8c" class="outline-4">
<h4 id="orgda55a8c"><span class="section-number-4">3.2.1</span> Starting a job in a reusable way</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
We will use the tool <a href="https://github.com/origoss/yemplate">yemplate</a> for starting the job. First, let's install
<code>yemplate</code>.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>Installing yemplate</label><pre class="src src-bash">go get -u https://github.com/origoss/yemplate
</pre>
</div>

<p>
<code>yemplate</code> let's us to create job manifest templates similarly to Helm
charts.
</p>

<p>
An example job manifest template can be found <a href="https://raw.githubusercontent.com/origoss/k8s-docker-build/master/docker-build.yaml.t">here</a>. We will use it to build
and push a Docker image with the following parameters:
</p>
<ul class="org-ul">
<li><b>git repository</b> where the Dockerfile is stored is at
<a href="https://github.com/origoss/dockergit.git">https://github.com/origoss/dockergit.git.</a></li>
<li><b>tags</b> of the resulting image are:
<ul class="org-ul">
<li>docker.origoss.local/dockergit:latest</li>
<li>origoss/dockergit:18.04.0-ce</li>
<li>origoss/dockergit:latest</li>
</ul></li>
</ul>

<p>
First, we check the job manifest that is created by <code>yemplate</code>.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>Creating the job manifest from template</label><pre class="src src-bash">yemplate -s <span style="color: #2d9574;">"gitrepo=https://github.com/origoss/dockergit.git"</span> <span style="color: #2d9574;">\</span>
         -s <span style="color: #2d9574;">"tags[0]=docker.origoss.local/dockergit:latest"</span>    <span style="color: #2d9574;">\</span>
         -s <span style="color: #2d9574;">"tags[1]=origoss/dockergit:18.04.0-ce"</span>             <span style="color: #2d9574;">\</span>
         -s <span style="color: #2d9574;">"tags[2]=origoss/dockergit:latest"</span>                 <span style="color: #2d9574;">\</span>
         -t https://raw.githubusercontent.com/origoss/k8s-docker-build/master/docker-build.yaml.t
</pre>
</div>

<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #7590db;">apiVersion</span>: batch/v1
<span style="color: #7590db;">kind</span>: Job
<span style="color: #7590db;">metadata</span>:
  <span style="color: #7590db;">name</span>: docker-image-builder
<span style="color: #7590db;">spec</span>:
  <span style="color: #7590db;">template</span>:
    <span style="color: #7590db;">spec</span>:
      <span style="color: #7590db;">containers</span>:
      - <span style="color: #7590db;">name</span>: builder
        <span style="color: #7590db;">image</span>: docker
        <span style="color: #7590db;">workingDir</span>: /git
        <span style="color: #7590db;">volumeMounts</span>:
        - <span style="color: #7590db;">name</span>: dockersock
          <span style="color: #7590db;">mountPath</span>: /var/run/docker.sock
        - <span style="color: #7590db;">name</span>: dockerconfig
          <span style="color: #7590db;">mountPath</span>: /root/.docker
        - <span style="color: #7590db;">name</span>: gitrepo
          <span style="color: #7590db;">mountPath</span>: /git
        <span style="color: #7590db;">command</span>:
        - sh
        - -c
        - |
          <span style="color: #2d9574;">set -e</span>
          TAGS=<span style="color: #2d9574;">"-t docker.origoss.local/dockergit:latest -t origoss/dockergit:18.04.0-ce -t origoss/dockergit:latest "</span>
<span style="color: #2d9574;">          cd $(ls -tc -1 | head -n1)</span>
          echo <span style="color: #2d9574;">"docker build $TAGS ."</span>
<span style="color: #2d9574;">          docker build $TAGS .</span>

          echo <span style="color: #2d9574;">"docker push docker.origoss.local/dockergit:latest"</span>
<span style="color: #2d9574;">          docker push docker.origoss.local/dockergit:latest</span>

          echo <span style="color: #2d9574;">"docker push origoss/dockergit:18.04.0-ce"</span>
<span style="color: #2d9574;">          docker push origoss/dockergit:18.04.0-ce</span>

          echo <span style="color: #2d9574;">"docker push origoss/dockergit:latest"</span>
<span style="color: #2d9574;">          docker push origoss/dockergit:latest</span>

      <span style="color: #7590db;">restartPolicy</span>: Never
      <span style="color: #7590db;">volumes</span>:
      - <span style="color: #7590db;">name</span>: dockersock
        <span style="color: #7590db;">hostPath</span>:
          <span style="color: #7590db;">path</span>: /var/run/docker.sock
          <span style="color: #7590db;">type</span>: Socket
      - <span style="color: #7590db;">name</span>: dockerconfig
        <span style="color: #7590db;">secret</span>:
          <span style="color: #7590db;">secretName</span>: docker-image-builder-secret
          <span style="color: #7590db;">items</span>:
          - <span style="color: #7590db;">key</span>: .dockerconfigjson
            <span style="color: #7590db;">path</span>: config.json
      - <span style="color: #7590db;">name</span>: gitrepo
        <span style="color: #7590db;">gitRepo</span>:
          <span style="color: #7590db;">repository</span>: https://github.com/origoss/dockergit.git
</pre>
</div>

<p>
We can use this template to run the job and build and push our Dockerfile in
Kubernetes.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 4: </span>Running the templated job in Kubernetes</label><pre class="src src-bash">yemplate -s <span style="color: #2d9574;">"gitrepo=https://github.com/origoss/dockergit.git"</span> <span style="color: #2d9574;">\</span>
         -s <span style="color: #2d9574;">"tags[0]=docker.origoss.local/dockergit:latest"</span>    <span style="color: #2d9574;">\</span>
         -s <span style="color: #2d9574;">"tags[1]=origoss/dockergit:18.04.0-ce"</span>             <span style="color: #2d9574;">\</span>
         -s <span style="color: #2d9574;">"tags[2]=origoss/dockergit:latest"</span>                 <span style="color: #2d9574;">\</span>
         -t https://raw.githubusercontent.com/origoss/k8s-docker-build/master/docker-build.yaml.t | <span style="color: #2d9574;">\</span>
    kubectl apply -f -
</pre>
</div>

<pre class="example">
job.batch "docker-image-builder" created

</pre>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="http://jpetazzo.github.io/2015/09/03/do-not-use-docker-in-docker-for-ci/">~jpetazzo/Using Docker-in-Docker for your CI or testing environment? Think twice.</a>
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Date: 2018-05-10 cs 00:00</p>
<p class="author">Author: Gergely Szabo</p>
<p class="date">Created: 2018-05-10 cs 17:31</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
